// Конфигурационный файл - /etc/syslog.conf (Раго стр 558).

// Cmd - сокращение от Centralized Message Distribution
// централизованное распределение сообщений

// Демоны - это долгоживущие процессы, которые не имеют управляющего
// терминала (т.е. работают в фоновом режиме)

#include "apue.h"

#include <errno.h>
#include <fcntl.h>
#include <signal.h>
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <syslog.h>	  // syslog, openlog
#include <sys/stat.h> // umask
#include <unistd.h>
#include <pthread.h>
#include <time.h> // time, ctime

#include <sys/time.h>
#include <sys/resource.h>

// LOCKFILE и LOCKMODE - 562 стр.
#define LOCKFILE "/var/run/daemon.pid"
#define LOCKMODE (S_IRUSR | S_IWUSR | S_IRGRP | S_IROTH)
// S_IRUSR - user-read – дос­туп­но поль­зо­ва­те­лю для чте­ния
// S_IWUSR - user-write – дос­туп­но поль­зо­ва­те­лю для за­пи­си
// S_IRGRP - group-read – дос­туп­но груп­пе для чте­ния
// S_IROTH - other-read – дос­туп­но ос­таль­ным для чте­ния

sigset_t mask;

/*
 * Установка блокировки для записи на весь файл
 * Блокировка файла для записи, чтобы обеспечить запуск единственного экземпляра программы.
 */
// Раго (новое издание) 570-571
int lockfile(int fd)
{
	// Эта структура используется для управления блокировкой и имеет следующее содержание:
	// struct flock
	// {
	// 	short l_type; /*3 режима блокирования
	//                F_RDLCK(блокировка для совместного чтения)
	//                F_WRLCK (исключительная блокировка для записи)
	//                F_UNLCK (снятие блокировки)*/

	// 	short l_whence; /*SEEK_SET;SEEK_CUR;SEEK_END*/

	// 	off_t l_start; /*относительное смещение в байтах,
	//               зависит от l_whence*/

	// 	off_t l_len; /*длина, 0=разделение до конца файла*/

	// 	pid_t l_pid; /*идентификатор, возвращается F_GETLK */
	// };

	struct flock fl;

	fl.l_type = F_WRLCK;	// Блокируем разделение записи
	fl.l_start = 0;			// Смещение относительно l_whence равно 0 (Т.е. начало файла)
	fl.l_whence = SEEK_SET; /*с начала файла*/
	fl.l_len = 0;			// 0 - Значит до конца файла.

	// fcntl - манипуляции с файловым дескриптором
	// F_SETLK - Установить блокировку
	// fl - данная структура будет применена к fd
	// и заблокирует тем самым на запись файл fd.
	return (fcntl(fd, F_SETLK, &fl));
}

/*
F_SETLK Установить блокировку, определение которой находится по адресу
flockptr. При попытке установить блокировку, несовместимую с существующей
(в соответствии с правилами в табл. 14.2), функция fcntl сразу же вернет управ-
ление с кодом ошибки EAGAIN или EACCES в переменной errno .
*/

/*
 * Функция демонстрирует использование блокировок файлов и запи­сей, 
   чтобы обеспечить запуск единственного экземпляра демона.
 */
// Каж­дая ко­пия де­мо­на бу­дет пы­тать­ся соз­дать файл и за­пи­сать в не­го свой
// иден­ти­фи­ка­тор про­цес­са. Ес­ли файл уже за­бло­ки­ро­ван, функ­ция lockfile
// за­вер­шит­ся не­уда­чей с ко­дом ошиб­ки EACCESS или EAGAIN
int already_running(void)
{
	int fd;
	char buf[16];

	// O_CREAT | O_RDWR - от­крыть или создать для чте­ния и для за­пи­си
	fd = open(LOCKFILE, O_RDWR | O_CREAT, LOCKMODE);
	if (fd < 0)
	{
		syslog(LOG_ERR, "Невозможно открыть %s: %s", LOCKFILE, strerror(errno));
		exit(1);
	}
	if (lockfile(fd) < 0)
	{
		if (errno == EACCES || errno == EAGAIN)
		{
			close(fd);
			return (1);
		}
		syslog(LOG_ERR, "Невозможно установить блокировку на %s: %s", LOCKFILE, strerror(errno));
		exit(1);
	}
	// ftruncate - усе­ка­ет раз­мер фай­ла до указанной длины (в нашем случае до 0),
	ftruncate(fd, 0);
	// За­пи­сы­ва­ем в файл иден­ти­фи­ка­тор про­цес­са.
	sprintf(buf, "%ld", (long)getpid());
	write(fd, buf, strlen(buf) + 1);
	return (0);
}

/*
 * Функция, которую может вызывать приложение, желающее стать демоном.
 */
// 553 страница. Там описаны все правила, которые нужно учитывать при реализации демона.
void daemonize(const char *cmd)
{
	int i, fd0, fd1, fd2;
	pid_t pid;
	struct rlimit rl;
	struct sigaction sa;

	/*
     * ПРАВИЛО 1: Сбросить маску режима создания файла.
     */

	// Сбрасываем маску именно до fork'а, т.к.
	// Процесс потомок унаследует (дескрипт-ы открытых файлов, сигнальную маску) И
	// маску создания файлов, т.к. предок сбросил маску создания, значит после вызова
	// fork потомок унаследует чистую маску.
	// Чтобы в дальнейшем демон мог создавать любые файлы с любыми правами.

	umask(0); // user mask

	/*
     * Получить максимально возможный номер дескриптора файла.
     */
	if (getrlimit(RLIMIT_NOFILE, &rl) < 0)
		err_quit("%s: невозможно получить максимальный номер дескриптора ", cmd);

	/*
     * ПРАВИЛО 2: Стать лидером нового сеанса, чтобы утратить управляющий терминал.
     */

	// Для того, чтобы в дальнейшем вызвать ф-цию setsid (создание нового сеанса)
	// Нужно, чтобы процесс, который ее вызывает не был лидером группы.

	if ((pid = fork()) < 0)
		err_quit("%s: ошибка вызова функции fork", cmd);
	else if (pid != 0) /* родительский процесс */
		exit(0);	   // Завершаем его!
	
	/*
	 * ПРАВИЛО 3: Лидер новой сеанса.
	 */
	// После вызова этой функции процесс ста­но­вит­ся
	// (а) ли­де­ром но­во­го се­ан­са, (б) ли­де­ром но­вой группы про­цес­сов и
	// (в) ли­ша­ет­ся управ­ляю­ще­го тер­ми­на­ла.
	setsid();

	/*
     * Обеспечить невозможность обретения управляющего терминала в будущем.
     */
	// SIG_IGN — игнорирования сигнала.
	// int sigemptyset(sigset_t *set);
	// sigemptyset инициализирует набор сигналов, указанный в set, и "очищает" его от всех сигналов.
	sa.sa_handler = SIG_IGN;
	// sa_mask задает маску сигналов, которые должны блокироваться при обработке сигнала.

	sigemptyset(&sa.sa_mask);
	sa.sa_flags = 0;
	// SIGHUP — сигнал, посылаемый процессу для уведомления о потере соединения с управляющим терминалом пользователя.
	// Системный вызов sigaction используется для изменения действий процесса при получении соответствующего сигнала.
	// !!! ТО ЕСТЬ: Игнорируем сигнал SIGHUP. !!!
	if (sigaction(SIGHUP, &sa, NULL) < 0)
		err_quit("%s: невозможно игнорировать сигнал SIGHUP", cmd);

	/*
     * Для систем, основанных на System V, некоторые специалисты рекомендуют в этой точке повторно вызвать функцию fork
     * и завершить родительский процесс, чтобы второй потомок продолжал работу в качестве демона.
     * Такой прием гарантирует, что демон не будет являться лидером сеанса,
     * и это препятствует получению управляющего терминала в System V.
     */
	// Стр 556 конец раздела:
	// ! Демон не яв­ля­ет­ся ли­де­ром се­ан­са, а по­это­му не име­ет воз­мож­но­сти об­рес­ти управ­ляю­щий тер­ми­нал.!
	// if ((pid = fork()) < 0)
	// 	err_quit("%s: ошибка вызова функции fork", cmd);
	// else if (pid != 0) // родительский процесс
	// 	exit(0);

	/*
     * ПРАВИЛО 4: Назначить корневой каталог текущим рабочим каталогом,
     * чтобы впоследствии можно было отмонтировать файловую систему.
     */
	// Текущий рабочий каталог – это каталог, в котором в данный момент работает пользователь.
	// Монтирование файловой системы — системный процесс, подготавливающий раздел диска к использованию операционной системой.
	if (chdir("/") < 0)
		err_quit("%s: невозможно сделать текущим рабочим каталогом /", cmd);

	/*
     * ПРАВИЛО 5: Закрыть все открытые файловые дескрипторы.
     */
	// Значение RLIM_INFINITY определяет отсутствие ограничений для ресурса.
	if (rl.rlim_max == RLIM_INFINITY)
		rl.rlim_max = 1024;
	for (int i = 0; i < rl.rlim_max; i++)
		close(i);

	/*
     * ПРАВИЛО 6: Присоединить файловые дескрипторы 0, 1 и 2 к /dev/null.
     */
	// Файловый дескриптор — это неотрицательное целое число.
	//  Когда создается новый поток ввода-вывода, ядро возвращает
	//  процессу, создавшему поток ввода-вывода, его файловый дескриптор.
	fd0 = open("/dev/null", O_RDWR);
	// int dup(int oldfd);
	// dup  создают копию файлового дескриптора oldfd.
	fd1 = dup(0);
	fd2 = dup(0);

	/*
     * Инициализировать файл журнала.
     */
	// cmd - Будет добавляться вначале к каждому выводу в лог-файл.
	// LOG_CONS - флаг управляющий работой.
	// Означает: написать сообщение об ошибке прямо на консоли,
	// если была ошибка при записи данных в системный журнал;
	// LOG_DAEMON - Тип программы, записывающей сообщения: системные демоны;
	// По умолчанию Unix-оболочки связывают файловый дескриптор
	// 0 с потоком стандартного ввода процесса (терминал), файловый дескриптор
	// 1 — с потоком стандартного вывода (терминал), и файловый дескриптор
	// 2 — с потоком диагностики (куда обычно выводятся сообщения об ошибках).
	// !! Лю­бые биб­лио­теч­ные функ­ции, ко­то­рые пы­та­ют­ся чи­тать
	// со стан­дарт­но­го уст­рой­ст­ва вво­да или писать
	// в стан­дарт­ное уст­рой­ст­во вы­во­да или со­об­ще­ний об ошиб­ках,
	// не бу­дут ока­зы­вать ни­ка­ко­го влия­ния. !!
	openlog(cmd, LOG_CONS, LOG_DAEMON);
	if (fd0 != 0 || fd1 != 1 || fd2 != 2)
	{
		syslog(LOG_ERR, "ошибочные файловые дескрипторы %d %d %d",
			   fd0, fd1, fd2);
		exit(1);
	}
}

void *thr_fn(void *arg)
{
	int err, signo;
	for (;;)
	{
		// Ожидает сигналы, указанные в mask (у нас восстановлены все сигналы)
		// Номер сигнала вернется в signo.
		err = sigwait(&mask, &signo);
		if (err != 0)
		{
			syslog(LOG_ERR, "ошиб­ка вы­зо­ва функ­ции sigwait");
			exit(1);
		}
		switch (signo)
		{
		case SIGHUP:
			syslog(LOG_INFO, "Получен сигнал SIGHUP getlogin = %s", getlogin());
			// reread();
			break;
		case SIGTERM:
			// SIGTERM (от англ. signal и terminate — завершить) — сигнал, применяемый в POSIX-системах для запроса завершения процесса
			syslog(LOG_INFO, "Получен сигнал SIGTERM; вы­ход");

			exit(0);
		default:
			syslog(LOG_INFO, "по­лу­чен не­пред­ви­ден­ный сиг­нал %d\n", signo);
		}
	}
	return (0);
}

int main(int argc, char *argv[])
{
	setbuf(stdout, NULL);
	printf("1\n");
	int err;
	pthread_t tid;
	char *cmd;
	// Системный вызов sigaction используется для изменения
	// действий процесса при получении соответствующего сигнала.
	struct sigaction sa;

	// char *strrchr(const char *s, int c);
	// Функция strrchr() возвращает указатель на местонахождение последнего совпадения
	// с символом c в строке s, а если символ не найден, то возвращают NULL.
	// if ((cmd = strrchr(argv[0], '/')) == NULL)
	// 	cmd = argv[0];
	// else
	// 	cmd++;
	// daemonize(cmd);

	daemonize("my_daemon");
	/*
     * Блокировка файла для одной существующей копии демона
     */
	if (already_running() != 0)
	{
		// syslog - от­прав­ля­ет со­об­ще­ния че­рез со­кет до­ме­на UNIX – /dev/log.
		syslog(LOG_ERR, "Демон уже запущен!\n");
		exit(1);
	}

	/*
	* Вос­ста­но­вить дей­ст­вие по умол­ча­нию для сиг­на­ла SIGHUP
	* и за­бло­ки­ро­вать все сиг­на­лы.
	*/
	// Нужно восстановить, т.к. в функции daemonize мы поставили
	// Игнорирование данного сигнала.

	// SIG_DFL - выполнения стандартных действий. (handler = обработчик)
	sa.sa_handler = SIG_DFL;
	// Зануляем маску. ("очищаем" его от всех сигналов.)
	// sa_mask задает маску сигналов, которые должны блокироваться при обработке сигнала.
	sigemptyset(&sa.sa_mask);
	sa.sa_flags = 0;
	// Системный вызов sigaction используется для изменения действий процесса при получении соответствующего сигнала.
	if (sigaction(SIGHUP, &sa, NULL) < 0)
		err_quit("%s: не­воз­мож­но вос­ста­но­вить дей­ст­вие SIG_DFL для SIGHUP");
	// int sigfillset(sigset_t *set);
	// sigfillset полностью инициализирует набор set, в котором содержатся все сигналы.
	sigfillset(&mask);
	// int pthread_sigmask (int how const sigset_t *set sigset_t *oset);
	// SIG_BLOCK - Union of the current mask and Fa set
	if ((err = pthread_sigmask(SIG_BLOCK, &mask, NULL)) != 0)
		err_exit(err, "ошиб­ка вы­пол­не­ния опе­ра­ции SIG_BLOCK");

	/*
	* Соз­дать по­ток для об­ра­бот­ки SIGHUP и SIGTERM.
	*/
	// NULL - атрибуты по умолчанию
	// arg = 0 не передаем аргументы.
	err = pthread_create(&tid, NULL, thr_fn, 0);
	if (err != 0)
		err_exit(err, "не­воз­мож­но соз­дать по­ток");

	syslog(LOG_WARNING, "Проверка пройдена!");

	// Переменная для сохранения текущего времени
	long int ttime;

	while (1)
	{
		ttime = time(NULL);
		syslog(LOG_INFO, "ДЕМОН для лаб1 ОС! Время: %s", ctime(&ttime));
		sleep(3);
	}
}